Console.Write("Введите значение: ");
int n = Convert.ToInt32(Console.ReadLine());
// 6. Напишите программу, которая на вход принмает число и
// выдает, является ли число четным (делится ли оно на два без остатка).
// 4 -> yes
// - 3 -> no
// 7 -> no
if (n % 2 == 0)
{
  Console.WriteLine ("yes");
}
else
 Console.WriteLine ("no");   